# Tap third-party repositories
# Note: homebrew/cask, homebrew/core, and homebrew/cask-fonts are now included by default
# and no longer need to be tapped explicitly in Homebrew 4.0+

tap 'jandedobbeleer/oh-my-posh'

##
# AI
##

# Claude AI Desktop App
cask 'claude'

# Ollama for Local LLM
brew 'ollama'

##
# Browsers
##

# Web browser with built-in email client focusing on customization and control
cask 'vivaldi'

##
# Chat
##

# Discord chat
cask 'discord'

# Private Chat - Signal
cask 'signal'

# Slack chat client
cask 'slack'

##
# Creative
##

# Adobe Creative Cloud
cask 'adobe-creative-cloud'

#mInstaller
cask 'minstaller'

##
# Development
##

# Jetbrains Toolbox to allow installing the full suite of Jetbrains Tools
cask 'jetbrains-toolbox'

# Note: Parallels must be installed manually due to macOS security restrictions
# Download from: https://www.parallels.com/products/desktop/download/

# Container runtimes on MacOS (and Linux) with minimal setup
brew 'colima'

# Tool for exploring each layer in a docker image
brew 'dive'

# Static Site Generator
brew 'hugo'

# Lightweight and flexible command-line JSON processor
brew 'jq'

# Terminal-based AI coding assistant
cask 'claude-code'

##
# Downloaders
##

# Wget is a free software package for retrieving files using HTTP and FTP.
brew 'wget'

# curl is a command line tool for transferring data with URL syntax.
brew 'curl', link: true

##
# Version control
##

# Git is a free and open source distributed version control system.
brew 'git'

##
# Security
##

# 1password is a password manager
cask '1password'

# Command-line interface for 1Password
cask '1password-cli'

# Note: Private Internet Access must be installed manually due to macOS security restrictions
# Download from: https://www.privateinternetaccess.com/pages/download

# VPN - Home - WiFiman Desktop
cask 'wifiman'

##
# Terminals
##

brew 'atuin'

# iTerm is our favorite terminal app.
cask 'iterm2'

# Prompt theme engine for any shell
brew 'jandedobbeleer/oh-my-posh/oh-my-posh'

brew 'tmux'

brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

##
# Utilities
##

# Application launcher and productivity software
cask 'alfred'

# Application uninstaller
cask 'appcleaner'

# Dotfile Management - Should already be installed
# brew chezmoi

# Note: CalDigit Thunderbolt Station drivers must be installed manually if you have this hardware
# Requires Rosetta 2 and kernel extension approval. See POST_INSTALL.md

# Screen Capture Tool
cask 'cleanshot'

# Image, video and clipboard optimiser
cask 'clop'

# Tool for setting default applications
brew 'duti'

# Stream Deck
cask 'elgato-stream-deck'

# Google Drive
cask 'google-drive'

# Automated Organizaion
cask 'hazel'

# Archive utility
cask 'keka'

# Mac App Store CLI
brew 'mas'

###########################################################################
#
# MAC APP STORE APPS
# Note: Requires signing into App Store first
# To find app IDs: mas search "app name"
#
###########################################################################

# Window management
mas 'Magnet', id: 441258766

# Keep your Mac awake
mas 'Amphetamine', id: 937984704

# Disk image utility
mas 'RapidDMG', id: 6444896245

# NEEWER lighting control
mas 'NEEWER Control Center', id: 1592424571

# Add more Mac App Store apps here

# Audio Book Conversion
cask 'openaudible'

# Upgrade all the things
brew 'topgrade'


##
# Brew cask enables installing typical Mac OS X applications.
# For example, these formulas may download a `*.dmg` file,
# then unpack it into the correct `/Applications` directory,
# and possibly configure the app with typical settings.
##

# Knowledge base that works on top of a local folder of plain text Markdown files
cask 'obsidian'
# Personal finance manager
cask 'quicken'

###########################################################################
#
# FONTS - Essential developer fonts only
# Full font list removed due to Homebrew deprecations on macOS 26.0
# Add additional fonts as needed from: https://github.com/Homebrew/homebrew-cask-fonts
#
###########################################################################

##
# Programming & Terminal Fonts
##

cask 'font-jetbrains-mono'
cask 'font-fira-code'
cask 'font-hack-nerd-font'
cask 'font-firacode-nerd-font'
cask 'font-firacode-nerd-font-mono'
cask 'font-source-code-pro'
cask 'font-inconsolata'
cask 'font-roboto-mono'
cask 'font-ubuntu-mono-derivative-powerline'

##
# General Purpose Fonts
##

cask 'font-roboto'
cask 'font-open-sans'
cask 'font-lato'
cask 'font-montserrat'
cask 'font-source-sans-pro'

# Original comprehensive font list (984 fonts) removed - many deprecated in Homebrew 4.0+
# To restore specific fonts, check availability first: brew search font-name

#############