# Brewfile.personal - Personal machine specific packages

##
# AI
##

cask 'claude'
cask 'lm-studio'

##
# Browsers
##

cask 'vivaldi'

##
# Security
##

cask '1password'
cask '1password-cli'
cask 'little-snitch'

##
# Chat & Communication
##

cask 'slack'
cask 'discord'
cask 'signal'

##
# Creative
##

cask 'adobe-creative-cloud'
cask 'minstaller'
cask 'prusaslicer'

# Note: DaVinci Resolve Studio must be installed manually
# See POST_INSTALL.md

##
# Development
##

cask 'jetbrains-toolbox'
cask 'claude-code'
cask 'antigravity'

# Node version manager
brew 'nvm'

# Note: Parallels must be installed manually due to macOS security restrictions
# Download from: https://www.parallels.com/products/desktop/download/

##
# Security (Personal)
##

# Note: Private Internet Access must be installed manually due to macOS security restrictions
# Download from: https://www.privateinternetaccess.com/pages/download

cask 'wifiman'

##
# Utilities
##

# Note: CalDigit Thunderbolt Station drivers must be installed manually if you have this hardware
# Requires Rosetta 2 and kernel extension approval. See POST_INSTALL.md

cask 'betterdisplay'
cask 'bettertouchtool'
cask 'cleanshot'
cask 'clop'
cask 'distroav'
cask 'elgato-stream-deck'
cask 'obs'

# Note: NeewerLite must be installed manually from DMG
# Download from: https://github.com/keefo/NeewerLite/releases
# See POST_INSTALL.md

# Note: RODECaster App must be installed manually
# Download from: https://rode.com/en-us/apps/rodecaster-app
# See POST_INSTALL.md
cask 'google-drive'
cask 'hazel'
cask 'jordanbaird-ice'

##
# Mac App Store Apps
##

mas 'Magnet', id: 441258766
mas 'RapidDMG', id: 6444896245

# Sindre Sorhus utilities (duplicated in work for policy flexibility)
mas 'Dato', id: 1470584107
mas 'Shareful', id: 1522267256
mas 'Actions', id: 1586435171
mas 'Speediness', id: 1596706466
mas 'One Thing', id: 1604176982
mas 'Shortery', id: 1594183810
mas 'Hyperduck', id: 6444667067
mas 'Camera Preview', id: 1632827132
mas 'Online Check', id: 6504709660
mas 'Short Run', id: 6745427035

# Personal only
mas 'Parcel - Delivery Tracking', id: 375589283
mas 'Simple Color Palette', id: 6744484427

##
# Productivity
##

cask 'openaudible'
cask 'obsidian'
cask 'quicken'
