# Brewfile.work - Work machine specific packages

##
# Browsers
##

# Work browser
cask 'google-chrome'

# Personal browser (also used for work)
cask 'vivaldi'

##
# Security
##

cask '1password'
cask '1password-cli'
cask 'little-snitch'

##
# Communication
##

cask 'slack'

# Microsoft Teams
cask 'microsoft-teams'

# Video conferencing
cask 'zoom'

##
# AI Tools
##

# ChatGPT desktop app
cask 'chatgpt'

##
# Development
##

# IDEs
cask 'jetbrains-toolbox'

# Node version manager
brew 'nvm'

# Company-specific tools
# brew 'your-company-cli'
# cask 'your-company-vpn'

##
# Utilities (duplicated with personal for future work policy changes)
##

# Display management
cask 'betterdisplay'
cask 'bettertouchtool'

# Screen capture tool
cask 'cleanshot'

# Image optimizer
cask 'clop'

# Stream Deck control
cask 'elgato-stream-deck'
cask 'obs'

# Note: NeewerLite must be installed manually from DMG
# Download from: https://github.com/keefo/NeewerLite/releases
# See POST_INSTALL.md

# Note: RODECaster App must be installed manually
# Download from: https://rode.com/en-us/apps/rodecaster-app
# See POST_INSTALL.md

# File automation
cask 'hazel'

# Menu bar management
cask 'jordanbaird-ice'

##
# Productivity
##

# Note-taking (used on both work and personal)
cask 'obsidian'

# Microsoft Office Suite (Word, Excel, PowerPoint, Outlook, OneNote)
cask 'microsoft-office'

# Additional productivity tools (uncomment as needed)
# cask 'notion'
# cask 'evernote'

##
# Mac App Store Apps
##

# Sindre Sorhus utilities (duplicated in personal for policy flexibility)
mas 'Dato', id: 1470584107
mas 'Shareful', id: 1522267256
mas 'Actions', id: 1586435171
mas 'Speediness', id: 1596706466
mas 'One Thing', id: 1604176982
mas 'Shortery', id: 1594183810
mas 'Hyperduck', id: 6444667067
mas 'Camera Preview', id: 1632827132
mas 'Online Check', id: 6504709660
mas 'Short Run', id: 6745427035

##
# Add your work-specific tools here
##

# Examples:
# brew 'kubectl'  # Kubernetes CLI
# brew 'terraform'  # Infrastructure as code
# brew 'awscli'  # AWS CLI
# cask 'docker'  # Docker Desktop (if allowed by company)
# cask 'postman'  # API testing
